---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectContext3D.VertexFormat
source: html/b04a7296-1883-708f-2d68-db8889c3016c.htm
---
# VertexFormat Methods

Tests whether the vertex format specification is valid for rendering.